jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32H7B3/FS_NOR_PHY_STM32H7B3.c
  BankIndex      = 0;
  NumSectorsBank = _NumSectors >> 1u;           // Two banks of equal sizes.
  if (SectorIndex >= NumSectorsBank) {
    BankIndex = 1;
  }
  return BankIndex;
}

/*********************************************************************
*
*      _CalcBRSI
*
*  Function description
*    Calculates the bank-relative sector index.
*/
static U32 _CalcBRSI(U32 SectorIndex) {
  U32 NumSectorsBank;

  NumSectorsBank = _NumSectors >> 1u;           // Two banks of equal sizes.
  if (SectorIndex >= NumSectorsBank) {
    SectorIndex -= NumSectorsBank;
  }
  return SectorIndex;
}

/*********************************************************************
*
*       _DisableDCache
*/
static void _DisableDCache(void) {
  U32 NumRegions;
  U32 iRegion;
  U32 Mask;
  U32 ldNumBytes;

  if (SCB_CCR & (1uL << CCR_DC_BIT)) {      // Is data cache enabled?
    NumRegions = (MPU_TYPE >> TYPE_DREGION_BIT) & TYPE_DREGION_MASK;
    //
    // Find the next free region.
    //
    for (iRegion = 0; iRegion < NumRegions; ++iRegion) {
      MPU_RNR = iRegion;
      if ((MPU_RASR & (1uL << RASR_ENABLE_BIT)) == 0) {
        break;            // Found a free region.
      }
      //
      // Check if we already configured the MPU.
      //
      Mask = 0uL
           | (RBAR_REGION_MASK << RBAR_REGION_BIT)
           | (1uL              << RBAR_VALID_BIT)
           ;
      if ((MPU_RBAR & ~Mask) == _StartAddrConf) {
        iRegion = NumRegions;
        break;            // Already configured.
      }
    }
    if (iRegion < NumRegions) {
      ldNumBytes = _ld(_NumBytesConf);
      //
      // Use MPU to disable the data cache on the memory region assigned to QSPI.
      //
      MPU_CTRL &= ~(1uL << CTRL_ENABLE_BIT);      // Disable MPU first.
      MPU_RNR   = iRegion & RNR_REGION_MASK;
      MPU_RBAR  = _StartAddrConf;
      MPU_RASR  = 0
                | (1uL              << RASR_XN_BIT)
                | (RASR_AP_FULL     << RASR_AP_BIT)
                | (1uL              << RASR_TEX_BIT)
                | ((ldNumBytes - 1) << RASR_SIZE_BIT)
                | (1uL              << RASR_ENABLE_BIT)
                ;
      //
      // Enable MPU.
      //
      MPU_CTRL |= 0
               | (1uL << CTRL_PRIVDEFENA_BIT)
               | (1uL << CTRL_ENABLE_BIT)
               ;
    }
  }
}

/*********************************************************************
*
*      _StartErase
*
*  Function description
*    Starts the execution of an erase operation.
*/
static void _StartErase(unsigned BankIndex, U32 brsi) {
  volatile U32 * pCR;
  volatile U32 * pCCR;

  pCR  = GET_CR(BankIndex);
  pCCR = GET_CCR(BankIndex);
  //
  // According to [1] all the errors have to be cleared before starting
  // the operation otherwise the operation will fail.
  //
  *pCCR |= 0u
        | (1uL << SR_EOP_BIT)
        | (1uL << SR_WRPERR_BIT)
        | (1uL << SR_PGSERR_BIT)
        | (1uL << SR_STRBERR_BIT)
        | (1uL << SR_INCERR_BIT)
        | (1uL << SR_RDPERR_BIT)
        | (1uL << SR_RDSERR_BIT)
        | (1uL << SR_SNECCERR_BIT)
        | (1uL << SR_DBECCERR_BIT)
        | (1uL << SR_CRCEND_BIT)
        | (1uL << SR_CRCDERR_BIT)
        ;
  //
  // Set flash controller to sector erase mode and select sector to be erased.
  //
  *pCR &= ~(CR_SSN_MASK << CR_SSN_BIT);
  *pCR |= 0
       | (1uL  << CR_SER_BIT)
       | (brsi << CR_SSN_BIT)
       ;
  //
  // Make sure that the data is written to register.
  //
  __ISB();
  __DSB();
  //
  // Start erasing.
  //
  *pCR |= 1uL << CR_START_BIT;
  //
  // Make sure that the data is written to register.
  //
  __ISB();
  __DSB();
}

/*********************************************************************
*
*      _CompleteErase
*
*   Function description
*     Ends the execution of an erase operation.
*/
static void _CompleteErase(unsigned BankIndex) {
  volatile U32 * pCR;

  pCR = GET_CR(BankIndex);
  *pCR &= ~((1uL         << CR_SER_BIT)   |
            (CR_SSN_MASK << CR_SSN_BIT));
}

/*********************************************************************
*
*      _EraseSector
*
*  Function description
*    Erases one physical sector.
*
*  Parameters
*    SectorIndex  Index of the physical sector to be erased.
*
*  Return value
*    ==0    OK, sector was erased.
*    !=0    Error, sector could not be erased.
*
*  Additional information
*    SectorIndex is relative to the beginning of flash memory range used as storage.
*/
static int _EraseSector(U32 SectorIndex) {
  int      IsLocked;
  int      r;
  unsigned BankIndex;
  U32      brsi;
  U32      StartSector;

  //
  // Convert to absolute sector index.
  //
  StartSector  = (_StartAddrUsed - _BaseAddr) >> LD_BYTES_PER_SECTOR;
  SectorIndex += StartSector;
  //
  // Calculate the bank-relative sector index.
  //
  BankIndex = _CalcBankIndex(SectorIndex);
  brsi      = _CalcBRSI(SectorIndex);
  //
  // Wait for the flash controller to become ready.
  //
  (void)_WaitForReady(BankIndex);
  //
  // If required, unlock the access to control register.
  //
  IsLocked = _UnlockIfRequired(BankIndex);
  //
  // Start the erase operation.
  //
  _StartErase(BankIndex, brsi);
  //
  // Wait for the end of operation.
  //
  r = _WaitForEndOfOperation(BankIndex);
  //
  // Finish the erase operation.
  //
  _CompleteErase(BankIndex);
  //
  // If required, lock again the access to the control register.
  //
  if (IsLocked != 0) {
    _Lock(BankIndex);
  }
  return r;
}

/*********************************************************************
*
*      _EnableProgram
*
*  Function description
*    Starts a programming operation.
*/
static void _EnableProgram(unsigned BankIndex) {
  volatile U32 * pCR;
  volatile U32 * pCCR;

  pCR  = GET_CR(BankIndex);
  pCCR = GET_CCR(BankIndex);
  //
  // According to [1] all the errors have to be cleared before starting
  // the operation otherwise the operation will fail.
  //
  *pCCR |= 0u
        | (1uL << SR_EOP_BIT)
        | (1uL << SR_WRPERR_BIT)
        | (1uL << SR_PGSERR_BIT)
        | (1uL << SR_STRBERR_BIT)
        | (1uL << SR_INCERR_BIT)
        | (1uL << SR_RDPERR_BIT)
        | (1uL << SR_RDSERR_BIT)
        | (1uL << SR_SNECCERR_BIT)
        | (1uL << SR_DBECCERR_BIT)
        | (1uL << SR_CRCEND_BIT)
        | (1uL << SR_CRCDERR_BIT)
        ;
  //
  // Make sure that the data is written to register.
  //
  __ISB();
  __DSB();
  *pCR |= 1uL << CR_PG_BIT;
  //
  // Make sure that the data is written to register.
  //
  __ISB();
  __DSB();
}

/*********************************************************************
*
*      _DisableProgram
*
*  Function description
*    Ends a programming operation.
*/
static void _DisableProgram(unsigned BankIndex) {
  volatile U32 * pCR;

